# *** Данные в Python #


# *** Тип данных и определение: int, float, str, ...

a1 = 1
a2 = -1.0
a3 = "string"

# *** Вывод типа переменной
print('Вывод типа переменной: ', '\na1: ', type(a1), '\na2: ', type(a2), '\na3: ', type(a3))
print('Отсутствие значения и Логический тип: ', '\nNone', type(None), '\nbool', type(a1 > a2), '\nbool', type(a1 == a2))


b1 = (0b0, 0b1, 0b10, 0b11, 0b100)
b2 = 1/2
b3 = 1e12
b4 = 1 * 10**12

# *** Вывод зеачения и типа переменной
print("переменная b1 = ", b1, "type: ", type(b1))
print("переменная b2 = ", b2, "type: ", type(b2))
print("переменная b3 = ", b3, "type: ", type(b3))
print("переменная b4 = ", b4, "type: ", type(b4))


# *** Фиксированное количество знаков после запятой
c1 = 1 / 3
c2 = c1

c1 = float('{0:.3f}'.format(c1))  # Ver.1 -- {:.3f}
c2 = ("%.3f" % c1) # Ver.2
# Вывод результата количество знаков после запятой
print('c1 = ', c1)
print('c2 = ', c2)


# End