## About GitHub

print('About GitHub:')

print("git init - создает новый репозиторий Git и инициализация директории для отсдеживания контроля версии по проекту")
print("git status - Проверка состояния фпйлов")
print("git add . - всех файлов или указваем только нужные через пробел. Для исключения используем файл: .gitignore")

print("git diff - позволяет проанализировать добавляемые изменения и исправить возможные ошибки")

print("git commit - добавление файлов для отслеживание версий. атрибуты -m ил -am, ускоряют процесс ввода комментария")
print("git rm - удаление отслеживаемого файла или отслеживаемых файлов из раздела проиндексированных файлов Git")
print("git mv - перемещает или переименовывает файлы, автоматически “уведомляя” об этих событиях область “Staging Area”:")

